emacs/init.el
;; -*- lexical-binding: t -*-

;;(require 'package)

;;(let* ((no-ssl (and (memq system-type '(windows-nt ms-dos))
;;                    (not (gnutls-available-p))))
;;       (proto (if no-ssl "http" "https")))
;;  (when no-ssl (warn "\
;;Your version of Emacs does not support SSL connections,
;;which is unsafe because it allows man-in-the-middle attacks.
;;There are two things you can do about this warning:
;;1. Install an Emacs version that does support SSL and be safe.
;;2. Remove this warning from your init file so you won't see it again."))
;;  (add-to-list 'package-archives (cons "melpa" (concat proto "://melpa.org/packages/")) t)
;;  ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
;;  ;; and `package-pinned-packages`. Most users will not need or want to do this.
;;  ;;(add-to-list 'package-archives (cons "melpa-stable" (concat proto "://stable.melpa.org/packages/")) t)
;;)

;; this allows for straight-version
;; this makes a faster initial time, but only check packages 
;; modified in a Emacs buffer
(setq straight-check-for-modifications '(check-on-save find-when-checking))

;; Use Straight for package installation / management
;; Bootstrap just enough to load configuration from a "literate" org-mode file
;; https://github.com/raxod502/straight.el/
(setq straight-repository-branch "develop")
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el"
       user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))




;; Install use-package
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
(use-package diminish)
(use-package bind-key :straight use-package)

;; set file for custom variables
(setq custom-file (locate-user-emacs-file ".emacs-custom.el"))
(unless (file-exists-p custom-file)
  (write-region "" nil custom-file))
(load custom-file)

;; This needs to be before loading config.org so I don't have to give
;; permission to load the file when it is symlinked.
(customize-set-variable
 'vc-follow-symlinks t "Follow Symlinks without asking")

;; Load configuration
;; TODO: Figure out how to make byte compilation work?
;; (let ((config-el (expand-file-name "config.el" user-emacs-directory))
;;       (config-org (expand-file-name "config.org" user-emacs-directory)))
;;   (if (and (file-exists-p config-el)
;;            (time-less-p (file-attribute-modification-time (file-attributes config-org))
;;                         (file-attribute-modification-time (file-attributes config-el))))
;;         (load-file config-el)
;;     (org-babel-load-file config-org)))



;(package-initialize) ;; only use with package.el, not straight.el

;; manually set load path
;;source: https://github.com/gilbertw1/emacs-literate-starter/blob/master/emacs.org#emacs-initialization
;;(eval-and-compile
;;  (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t))))

;; We load cask early to allow overriding built-in packages.
;;
;; Specifically, we need to initialize cask before calling
;; 'org-babel-load-file, in order to prevent the built-in org
;; being loaded.
;;(add-to-list 'load-path (locate-user-emacs-file "cask/elpa"))
;;(require 'cask "~/.cask/cask.el")
;;(cask-initialize)


;;(org-babel-load-file (locate-user-emacs-file "config.org"))
;;(org-babel-load-file (locate-user-emacs-file "minimal_config.org"))

;; only with use package 
;;  (unless (package-installed-p 'use-package)
;;    (package-refresh-contents)
;;    (package-install 'use-package))

;;(eval-when-compile
;;  (require 'use-package))

;; set garbage collection to a higher to reduce initialization time
;;source: https://emacs.stackexchange.com/questions/2286/what-can-i-do-to-speed-up-my-start-up
(add-hook 'emacs-startup-hook 'my/set-gc-threshold)
(defun my/set-gc-threshold ()
  "Reset `gc-cons-threshold' to its default value."
  (setq gc-cons-threshold 
   100000000 ;; lsp-value
   ;; 800000 ;; original value
  )
)

;; manually set load path
;;source: https://github.com/gilbertw1/emacs-literate-starter/blob/master/emacs.org#emacs-initialization
;;(eval-and-compile
;;  (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t))))

;; doom's disable of file-name-handler-alist
 (defvar doom--file-name-handler-alist file-name-handler-alist)
 (setq file-name-handler-alist nil)

;; restore file-name-handler-alist:
(add-hook 'emacs-startup-hook
  (lambda ()
    (setq file-name-handler-alist doom--file-name-handler-alist)))

(use-package tramp
  :config
  (require 'tramp)
  
  (custom-set-variables
   '(tramp-default-method "ssh")
   '(tramp-default-user "eliasy")
   '(tramp-default-host "cedro.lbic.fee.unicamp.br")
   )
)

(use-package docker-tramp
  :config
  (require 'docker-tramp)
)

(electric-indent-mode 0)

(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-default t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

(fset 'yes-or-no-p 'y-or-n-p)

(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )

(set-face-attribute 'default nil :height 120)

;; Use a hook so the message doesn't get clobbered by other messages.
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

(use-package esup
  ;;  ;;:defer t
  ;; To use MELPA Stable use ":pin mepla-stable",
  ;;:pin melpa
  ;;:commands (esup)
  :config
;; Work around a bug where esup tries to step into the byte-compiled
;; version of `cl-lib', and fails horribly.
;;source: https://github.com/jschaf/esup/issues/54#issuecomment-651247749
 (setq esup-depth 0)
)

;; USE THIS
;;use-package version doesn't work
;;(straight-use-package 'esup)
;;(setq esup-depth 0)

;; add bullets to org preview
;; (use-package org-bullets
;;;;   :defer t
;;   :after org
;;   :init
;;   (add-hook 'org-mode-hook #'org-bullets-mode))

(use-package org-superstar ; "prettier" bullets
  :hook (org-mode . org-superstar-mode)
)

(use-package org-fragtog 
  :defer t
  :after org
  :init
  (add-hook 'org-mode-hook 'org-fragtog-mode)
)

(use-package htmlize
  :defer t
  :after org
)
