emacs/config.org
** Org-ref configuration

#+BEGIN_SRC emacs-lisp   
(use-package org-ref 
  :defer t
  :after org
  :config
  ;; set default directories
  (setq reftex-default-bibliography '("/home/eliasy/notes/zettelkasten/bibliography/full_library.bib"))
  ;; see org-ref for use of these variables
  (setq org-ref-bibliography-notes "/home/eliasy/notes/zettelkasten/"
        org-ref-default-bibliography '("/home/eliasy/notes/zettelkasten/bibliography/full_library.bib")
  )
  ;; org latex build format (necessary to output the citation in latex)
  (setq org-latex-pdf-process
        '("pdflatex -interaction nonstopmode -output-directory %o %f"
    	  "bibtex %b"
    	  "pdflatex -interaction nonstopmode -output-directory %o %f"
    	  "pdflatex -interaction nonstopmode -output-directory %o %f"))
)
#+END_SRC

** Bibtex search support

#+begin_src emacs-lisp
;; enable and install helm
(use-package helm-bibtex
  :defer t
  :after helm
  :config
  (setq bibtex-completion-bibliography "/home/eliasy/notes/zettelkasten/bibliography/full_library.bib")
  (setq bibtex-completion-notes-path "/home/eliasy/notes/zettelkasten/")
)
 #+end_src

** Org-capture templates

 #+BEGIN_SRC emacs-lisp   


 (defun capture-note (path)
   (let ((name (read-string "Name: ")))
     (expand-file-name (format "%s.org"  name) path)
   )
 )
(defun ey--load-org-capture-templates ()
 (setq org-capture-templates
 ;; Never forget: you must include a star (*) top heading in the template
  '(
    ("n" "note")
    ("nb"
     "bibliography"
     plain 
     (file (lambda () (capture-note "~/notes/zettelkasten/bibliography")))
 "#+SETUPFILE: ~/notes/zettelkasten/css/setup.config 
 #+INTERLEAVE_PDF: %^{Path of the file} 
 #+BIBLIOGRAPHY:/home/eliasy/notes/zettelkasten/bibliography/full_library.bib plain option:-d
 #+TITLE: %^{Title of the note}
 #+BEGIN_VERSE
 :AUTHORS: %^{Who are the authors?}
 :PAPER_TYPE: %^{What type is the paper? |Empirical|Theoretical|Both}
 :PERIOD: %^{Which period the paper covers, if empirical? |NA}
 :COUNTRY: %^{Which countries the paper covers, if empirical? (separated by semicollon) |NA}
 :DATA_TYPE: %^{What is the data type (time-series, panel, cross-section)? |NA|panel data|time-series|cross-section}
 :DATASETS: %^{What are the datasets/surveys used in their country denomination, if available?|NA}
 :DISAGGREGATION_LVL: %^{What is the level of disaggregation of the data (firm, individual, city, state, country)? |NA|firm|individual|city|state|country}
 :N_OBS: %^{What is the number of observations, if empirical? |NA}
 :ISIC: %^{What are the ISIC sectors covered, if empirical and at the industry/firm level?|NA|10-33}
 :DEP_VAR: %^{What are the main dependent variables, if empirical? |NA}
 :INDEP_VAR: %^{What are the main independent variables, if empirical? |NA}
 :EST: %^{What are the estimators used, if empirical? |NA}
 :MODEL: %^{Is there a theoretical model in the paper? |y|n}
 :REVIEW: %^{Is it a literature review, if theoretical? |y|n}
 :RESULTS: %^{Fill with results worth saving, if necessary |NA}
 :CONCL: %^{Fill with paper's main conclusion, if possible |NA}
 :TAGS: %^{Fill with other tags, if necessary |NA}
 #+END_VERSE
 \n* Notes
 %? 
 bibliography:/home/eliasy/notes/zettelkasten/bibliography/full_library.bib 
 bibliographystyle:apacite
 "
 ;; Other useful options
 ;;#+LATEX_HEADER: \setlist[itemize]{noitemsep, topsep=0pt}
 ;;#+LATEX_HEADER: \setlist[enumerate]{noitemsep, topsep=0pt}
 )
     ("nn" 
     "new parent note"
     plain 
     (file (lambda () (capture-note "~/notes/zettelkasten")))
 "
 #+SETUPFILE: ~/notes/zettelkasten/css/setup.config
 #+BIBLIOGRAPHY:/home/eliasy/notes/zettelkasten/bibliography/full_library.bib plain option:-d
 #+TITLE: %^{Title of the note}
 :TAGS: %^{Fill with other tags, if necessary |NA}
 \n* Notes
 %? 
 bibliography:/home/eliasy/notes/zettelkasten/bibliography/full_library.bib
 bibliographystyle:apacite
 "
 )

    ("a" "agenda")
    ("at" "todo" entry (file "~/notes/to-do-list.org")
     "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
    ("am" "Meeting" entry (file "~/notes/to-do-list.org")
     "* Meeting with %? :MEETING:\n" :clock-in t :clock-resume t)
    ("an" "Next Task" entry (file "~/notes/to-do-list.org")
     "** NEXT %? \nDEADLINE: %t")

;;    ("at" 
;;     "to-do list"
;;     entry 
;;     (file "~/notes/to-do-list.org")
;; "* TODO %?")
   )
 )
)

;; == Capture Mode Settings ==
;; Define the custum capture templates
;;(defvar org-capture-templates
;;	 ("n" "Next Task" entry (file+headline org-default-notes-file "Tasks")
;;	  "** NEXT %? \nDEADLINE: %t")

#+END_SRC

** Directory configuration
#+BEGIN_SRC emacs-lisp   
;;(use-package ox-publish 
;;;;  :config
(defun ey--load-org-directory ()
  (setq org-publish-project-alist
   '(
       ;; ... add all the components here (see below)...

;;     ("zettel-inherit"
;;      :base-directory "~/notes/zettelkasten/css"
;;      :recursive t
;;      :base-extension "css\\|js"
;;      :publishing-directory "~/notes/zettelkasten_html/"
;;      :publishing-function org-publish-attachment
;;     )
     
     ("org-notes"
       :base-directory "~/notes/zettelkasten"
       :base-extension "org"
       :publishing-directory "~/notes/zettelkasten_html/"
       :recursive t
       :publishing-function org-html-publish-to-html
       :headline-levels 4             ; Just the default for this project.
       :auto-preamble t
     )

     ("org-static"
      :base-directory "~/notes/zettelkasten"
      ;;:base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
      :base-extension "png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
      :publishing-directory "~/notes/zettelkasten_html/"
      :recursive t
      :publishing-function org-publish-attachment
      )

     ("org" :components ("org-notes" "org-static"))
     
    )
  )
)
;;)
#+END_SRC

** Editing packages for org-latex-preview / adding code highlight

This is used to add the cancel package, which makes possible to 
use an arrow to say that variables converge to zero in the limit.


To use the minted package is necessary to install pygments, a python package.
Install it on the emacs container or your use environment. 
See more detail with help org-latex-listings:

(setq org-latex-listings 'minted)

causes source code to be exported using the minted package as
opposed to listings.  If you want to use minted, you need to add
the minted package to ‘org-latex-packages-alist’, for example
using customize, or with

  (require 'ox-latex)
  (add-to-list 'org-latex-packages-alist '("newfloat" "minted"))

In addition, it is necessary to install pygments
(URL ‘http://pygments.org>’), and to configure the variable
‘org-latex-pdf-process’ so that the -shell-escape option is
passed to pdflatex.

#+BEGIN_SRC emacs-lisp   
(defun ey--load-org-latex-packages () 
(add-to-list 'org-latex-packages-alist '("" "cancel" t)) ;; add strike-lines for equations
(add-to-list 'org-latex-packages-alist '("margin=3cm" "geometry" t)) ;; stretch margins
(add-to-list 'org-latex-packages-alist '("" "parskip" t)) ;; add space between paragraphs
(add-to-list 'org-latex-packages-alist '("" "enumitem" t)) ;; remove space between bullets
;;(add-to-list 'org-latex-packages-alist '("round" "natbib" t)) ;; add package for bibliography
(add-to-list 'org-latex-packages-alist '("natbibapa" "apacite" t)) ;; add package for bibliography
(add-to-list 'org-latex-packages-alist '("" "lmodern" t)) ;; correctly copyable characters from pdf output 
(add-to-list 'org-latex-packages-alist '("" "cmap" t)) ;; correctly copyable characters from pdf output
(add-to-list 'org-latex-packages-alist '("portuguese" "babel" t)) ;; correctly copyable characters from pdf output
(add-to-list 'org-latex-packages-alist '("" "booktabs" t)) ;; links with color
(add-to-list 'org-latex-packages-alist '("" "minted" t)) ;; highlight code syntax
(add-to-list 'org-latex-packages-alist '("" "color" t)) ;; highlight code syntax
(add-to-list 'org-latex-packages-alist '("colorlinks = true, linkcolor=blue" "hyperref" t)) ;; links with blue color, hyperref must always come after minted
(setq org-latex-listings 'minted) ;; highlight code syntax
(add-to-list 'org-latex-packages-alist '("" "amsthm" t)) ;; makes for nice theorems and proof environments 
)
#+END_SRC

