emacs/config.org
** Org-babel configuration

#+BEGIN_SRC emacs-lisp   
(defun ey--load-org-babel-config ()
 (setq org-confirm-babel-evaluate nil
       org-src-fontify-natively t
 ;;      org-src-tab-acts-natively t
 )

 (custom-set-variables
  '(org-babel-load-languages 
    (quote (
     (emacs-lisp . t) 
     (R          . t)
     (python     . t)
     (shell      . t)
     )
    )
   )
  '(org-confirm-babel-evaluate nil)
 )
)
#+END_SRC

** Org block templates
   
#+BEGIN_SRC emacs-lisp   
;;(use-package org-tempo
;;;;  :config
(defun ey--load-org-babel-templates ()
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
)
;;)
 #+END_SRC

** Org-agenda config

Heavily borrowed from [[http://cachestocaches.com/2016/9/my-workflow-org-agenda/][here]], [[https://github.com/gjstein/emacs.d/blob/master/config/gs-org.el][here]] and [[https://github.com/gjstein/emacs.d/blob/master/config/gs-org-agenda.el][here]], which borrowed from [[http://doc.norang.ca/org-mode.html][Bernt Hansen's excellent guide]]. 

Guides:
- [[https://writequit.org/denver-emacs/presentations/2017-04-11-time-clocking-with-org.html][writequit]] 


The triggers for the agenda tags break down to the following rules:
- Moving a task to CANCELLED adds a CANCELLED tag
- Moving a task to WAITING adds a WAITING tag
- Moving a task to HOLD adds WAITING and HOLD tags
- Moving a task to a done state removes WAITING and HOLD tags
- Moving a task to TODO removes WAITING, CANCELLED, and HOLD tags
- Moving a task to NEXT removes WAITING, CANCELLED, and HOLD tags
- Moving a task to DONE removes WAITING, CANCELLED, and HOLD tags

