emacs/init.el
 (setq org-confirm-babel-evaluate nil
       org-src-fontify-natively t
 ;;      org-src-tab-acts-natively t
 )

 (custom-set-variables
  '(org-babel-load-languages 
    (quote (
     (emacs-lisp . t) 
     (R          . t)
     (python     . t)
     (shell      . t)
     )
    )
   )
  '(org-confirm-babel-evaluate nil)
 )
)

;;(use-package org-tempo
;;;;  :config
(defun ey--load-org-babel-templates ()
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
)
;;)
