emacs/config.org
*** Org-agenda display 

#+BEGIN_SRC emacs-lisp   
(load "~/.emacs.d/functions/org-agenda-functions")
;;(use-package org-agenda-functions
;; :load-path "~/.emacs.d/functions"
;;)

(defun ey--agenda_display () 

  ;; it is necessary to load the package directly
  ;; to access functions such as org-agenda-overriding-header
  ;;
  (require 'org-agenda)

  ;; Compact the block agenda view (disabled)
  (setq org-agenda-compact-blocks nil)

  ;; Set default column view headings: Task Effort Clock_Summary
  (setq org-columns-default-format "%50ITEM(Task) %10Effort(Effort){:} %10CLOCKSUM %16TIMESTAMP_IA")

  ;; Display properties

  ;; sets up tag alignment
  ;;(setq org-tags-column 8)
  ;;(setq org-agenda-tags-column org-tags-column)

  ;; see this answer: 
  ;; https://emacs.stackexchange.com/questions/44665/is-there-a-way-to-suggest-label-names-in-org-mode-latex-export
  ;; Use user-provided labels instead of internal ones when non-nil.
  ;; When this variable is non-nil, Org will use the value of CUSTOM_ID property,
  ;; NAME keyword or Org target as the key for the \label commands generated.
  ;; By default, Org generates its own internal labels during LaTeX export. 
  ;; This process ensures that the \label keys are unique and valid, but it means 
  ;; the keys are not available in advance of the export process.
  ;; Setting this variable gives you control over how Org generates labels during 
  ;; LaTeX export, so that you may know their keys in advance. One reason to do 
  ;; this is that it allows you to refer to various elements using a single label 
  ;; both in Org’s link syntax and in embedded LaTeX code. 
  ;;(setq org-latex-prefer-user-labels t)
 
  ;; child entries block change of status of parent entry
  ;; undone TODO entries will block switching the parent to DONE.
  ;; Also, if a parent has an :ORDERED: property, switching an entry to DONE will
  ;; be blocked if any prior sibling is not yet done.
  ;; Finally, if the parent is blocked because of ordered siblings of its own,
  ;; the child will also be blocked.
  ;; blocked tasks (and other settings)
  (setq org-enforce-todo-dependencies t)
  
  ;; Allow setting single tags without the menu
  ;; (setq org-fast-tag-selection-single-key 'expert)
  
  ;; Include the todo keywords
  ;;(setq org-fast-tag-selection-include-todo t)

  ;; Set the times to display in the time grid
  (setq org-agenda-time-grid
        (quote
         ((daily today remove-match)
          (800 1200 1600 2000)
          "......" "----------------")))

   ;; Custom colors for the keywords
   (setq org-todo-keyword-faces
         '(("TODO" :foreground "red" :weight bold)
           ("TASK" :foreground "#5C888B" :weight bold)
           ("NEXT" :foreground "blue" :weight bold)
           ("PROJ" :foreground "magenta" :weight bold)
           ("MOTIVATOR" :foreground "#F06292" :weight bold)
           ("DONE" :foreground "forest green" :weight bold)
           ("WAITING" :foreground "orange" :weight bold)
           ("INACTIVE" :foreground "magenta" :weight bold)
           ("SOMEDAY" :foreground "cyan" :weight bold)
           ("CANCELLED" :foreground "forest green" :weight bold)))

  ;;;; Agenda block definitions
  
  (defvar gs-org-agenda-block--today-schedule
    '(agenda "" ((org-agenda-overriding-header "Today's Schedule:")
  	       (org-agenda-span 'day)
  	       (org-agenda-ndays 1)
  	       (org-agenda-start-on-weekday nil)
  	       (org-agenda-start-day "+0d")))
    "A block showing a 1 day schedule.")
  
  (defvar gs-org-agenda-block--weekly-log
    '(agenda "" ((org-agenda-overriding-header "Weekly Log")))
    "A block showing my schedule and logged tasks for this week.")
  
  (defvar gs-org-agenda-block--previous-calendar-data
    '(agenda "" ((org-agenda-overriding-header "Previous Calendar Data (last 3 weeks)")
  	       (org-agenda-start-day "-21d")
  	       (org-agenda-span 21)
  	       (org-agenda-start-on-weekday nil)))
    "A block showing my schedule and logged tasks for the last few weeks.")
  
  (defvar gs-org-agenda-block--upcoming-calendar-data
    '(agenda "" ((org-agenda-overriding-header "Upcoming Calendar Data (next 2 weeks)")
  	       (org-agenda-start-day "0d")
  	       (org-agenda-span 14)
  	       (org-agenda-start-on-weekday nil)))
    "A block showing my schedule for the next couple weeks.")
  
;;  (defvar gs-org-agenda-block--refile
;;    '(tags "REFILE-ARCHIVE-REFILE=\"nil\"|INFO"
;;  	 ((org-agenda-overriding-header "Headings needing refiling or other info:")
;;  	  (org-tags-match-list-sublevels nil)))
;;    "Headings needing refiling or other info.")
  
  (defvar gs-org-agenda-block--next-tasks
    '(tags-todo "-INACTIVE-SOMEDAY-CANCELLED-ARCHIVE/!NEXT"
  	      ((org-agenda-overriding-header "Next Tasks:")
  	       ))
    "Next tasks.")
  
  (defvar gs-org-agenda-block--active-projects
    '(tags-todo "-INACTIVE-SOMEDAY-CANCELLED-REFILEr/!"
  	      ((org-agenda-overriding-header "Active Projects:")
  	       (org-agenda-skip-function 'gs/select-projects)))
    "All active projects: no inactive/someday/cancelled/refile.")
  
  (defvar gs-org-agenda-block--standalone-tasks
    '(tags-todo "-INACTIVE-SOMEDAY-CANCELLED-REFILE-ARCHIVE-STYLE=\"habit\"/!-NEXT"
  	      ((org-agenda-overriding-header "Standalone Tasks:")
  	       (org-agenda-skip-function 'gs/select-standalone-tasks)))
    "Tasks (TODO) that do not belong to any projects.")
  
  (defvar gs-org-agenda-block--waiting-tasks
    '(tags-todo "-INACTIVE-SOMEDAY-CANCELLED-ARCHIVE/!WAITING"
  	     ((org-agenda-overriding-header "Waiting Tasks:")
  	      ))
    "Tasks marked as waiting.")
  
  (defvar gs-org-agenda-block--remaining-project-tasks
    '(tags-todo "-INACTIVE-SOMEDAY-CANCELLED-WAITING-REFILE-ARCHIVE/!-NEXT"
  	      ((org-agenda-overriding-header "Remaining Project Tasks:")
  	       (org-agenda-skip-function 'gs/select-project-tasks)))
    "Non-NEXT TODO items belonging to a project.")
  
  (defvar gs-org-agenda-block--inactive-tags
    '(tags-todo "-SOMEDAY-ARCHIVE-CANCELLED/!INACTIVE"
  	 ((org-agenda-overriding-header "Inactive Projects and Tasks")
  	  (org-tags-match-list-sublevels nil)))
    "Inactive projects and tasks.")
  
  (defvar gs-org-agenda-block--someday-tags
    '(tags-todo "-INACTIVE-ARCHIVE-CANCELLED/!SOMEDAY"
  	 ((org-agenda-overriding-header "Someday Projects and Tasks")
  	  (org-tags-match-list-sublevels nil)))
    "Someday projects and tasks.")
  
  (defvar gs-org-agenda-block--end-of-agenda
    '(tags "ENDOFAGENDA"
  	 ((org-agenda-overriding-header "End of Agenda")
  	  (org-tags-match-list-sublevels nil)))
    "End of the agenda.")
  
  (defvar gs-org-agenda-display-settings
    '((org-agenda-start-with-log-mode t)
      (org-agenda-log-mode-items '(clock))
      (org-agenda-prefix-format '((agenda . "  %-12:c%?-12t %(gs/org-agenda-add-location-string)% s")
  				(timeline . "  % s")
  				(todo . "  %-12:c %(gs/org-agenda-prefix-string) ")
  				(tags . "  %-12:c %(gs/org-agenda-prefix-string) ")
  				(search . "  %i %-12:c")))
      (org-agenda-todo-ignore-deadlines 'near)
      (org-agenda-todo-ignore-scheduled t))
    "Display settings for my agenda views.")
  
  (defvar gs-org-agenda-entry-display-settings
    '(,gs-org-agenda-display-settings
      (org-agenda-entry-text-mode t))
    "Display settings for my agenda views with entry text.")

  ;;;; Agenda Definitions
  (setq org-agenda-custom-commands
        `(
;;          ("h" "Habits" agenda "STYLE=\"habit\""
;;           ((org-agenda-overriding-header "Habits")
;;            (org-agenda-sorting-strategy
;;             '(todo-state-down effort-up category-keep))))
          ("d" "My schedule"                       ;; key + description
           (,gs-org-agenda-block--today-schedule
 ;;           ,gs-org-agenda-block--refile
            ,gs-org-agenda-block--next-tasks
            ,gs-org-agenda-block--active-projects
            ,gs-org-agenda-block--end-of-agenda)   ;; desc
           ,gs-org-agenda-display-settings)
          ("L" "Weekly Log"
           (,gs-org-agenda-block--weekly-log)
           ,gs-org-agenda-display-settings)
          ("r " "Agenda Review (all)"
           (,gs-org-agenda-block--next-tasks
;;            ,gs-org-agenda-block--refile
            ,gs-org-agenda-block--active-projects
            ,gs-org-agenda-block--standalone-tasks
            ,gs-org-agenda-block--waiting-tasks
            ,gs-org-agenda-block--remaining-project-tasks
            ,gs-org-agenda-block--inactive-tags
            ,gs-org-agenda-block--someday-tags
            ,gs-org-agenda-block--end-of-agenda)
           ,gs-org-agenda-display-settings)
          ("rn" "Agenda Review (next tasks)"
           (,gs-org-agenda-block--next-tasks
            ,gs-org-agenda-block--end-of-agenda)
           ,gs-org-agenda-display-settings)
          ("rp" "Agenda Review (previous calendar data)"
           (,gs-org-agenda-block--previous-calendar-data
            ,gs-org-agenda-block--end-of-agenda)
           ,gs-org-agenda-display-settings)
          ("ru" "Agenda Review (upcoming calendar data)"
           (,gs-org-agenda-block--upcoming-calendar-data
            ,gs-org-agenda-block--end-of-agenda)
           ,gs-org-agenda-display-settings)
          ("rw" "Agenda Review (waiting tasks)"
           (,gs-org-agenda-block--waiting-tasks
            ,gs-org-agenda-block--end-of-agenda)
           ,gs-org-agenda-display-settings)
          ("rP" "Agenda Review (projects list)"
           (,gs-org-agenda-block--active-projects
            ,gs-org-agenda-block--end-of-agenda)
           ,gs-org-agenda-display-settings)
          ("ri" "Agenda Review (someday and inactive projects/tasks)"
           (,gs-org-agenda-block--someday-tags
            ,gs-org-agenda-block--inactive-tags
            ,gs-org-agenda-block--end-of-agenda)
           ,gs-org-agenda-display-settings)
          ))



)
#+END_SRC 
