emacs/init.el
  ;; set default agenda files
  (setq org-agenda-files '("~/notes/to-do-list.org"))
 
  ;; add time when item is closed 
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-log-state-notes-insert-after-drawers nil)
 
  ;; Allows the use of keybindings to
  ;; select tags
  (setq org-use-fast-todo-selection t)
 
  ;; set the possible states for each item type
  ;; keybindings are first item in parentheses
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "PROJ(p)" "|" "DONE(d)")
          (sequence "TASK(T)")
          (sequence "MEETING(M)" "|" "DONE(d)" "CANCELLED(c@/!)")
          (sequence "WAITING(w@/!)" "INACTIVE(i)" "SOMEDAY(s)" "|" "CANCELLED(c@/!)")
         )
  )


  ;; == Agenda Display == 

  ;; Custom Display  
  (ey--agenda_display)
  
  ;; Non-nil means agenda q key will bury agenda buffers.
  ;; Agenda commands will then show existing buffer instead of generating new ones.
  ;;When nil, ‘q’ will kill the single agenda buffer.
  ;;(setq org-agenda-sticky t)

  ;; When this variable is t, the initialization of the Org agenda
  ;; buffers is inhibited: e.g. the visibility state is not set, the
  ;; tables are not re-aligned, etc.
  ;; mainly for speed, see
  ;; https://orgmode.org/manual/Speeding-Up-Your-Agendas.html
  (setq org-agenda-inhibit-startup t)
 
  ;; Dim currently blocked TODOs in the agenda display.
  ;; When INVISIBLE is non-nil, hide currently blocked TODO instead of
  ;; dimming them.
  ;; mainly for speed, see
  ;; https://orgmode.org/manual/Speeding-Up-Your-Agendas.html
  (setq org-agenda-dim-blocked-tasks nil)

  ;; == Clock ==

  ;; set default task for punching in (in my case, the entry "organization")
  (defvar bh/organization-task-id "a2e954ce-bc30-454e-b4c2-3f90227fbbac")

  ;; Set task to a special todo state while clocking it.
  ;; The value should be the state to which the entry should be
  ;; switched.  If the value is a function, it must take one
  ;; parameter (the current TODO state of the item) and return the
  ;; state to switch it to.
  ;; If not a project, clocking-in changes TODO to NEXT
  (setq org-clock-in-switch-to-state 'bh/clock-in-to-next)

  ;; Show lot of clocking history so it's easy to pick items off the list 
  (setq org-clock-history-length 20)

  ;; Sometimes I change tasks I'm clocking quickly - this removes clocked tasks
  ;; with 0:00 duration
  (setq org-clock-out-remove-zero-time-clocks t)

  ;; Clock out when moving task to a done state
  (setq org-clock-out-when-done t)

  ;; global Effort estimate values
  ;; see https://orgmode.org/manual/Effort-Estimates.html
  (setq org-global-properties
        '(("Effort_ALL" .
           "0:15 0:30 0:45 1:00 1:30 2:00 2:30 3:00 4:00 5:00")))
  ;;        1    2    3    4    5    6    7    8    9    0
  ;; These are the hotkeys ^^
 
  ;; set allarm when effort for today runs out
  ;; see also repeated tasks in the manual
  ;; https://orgmode.org/manual/Repeated-tasks.html#Repeated-tasks
  (setq org-clock-sound "~/.emacs.d/tones/A-Tone.wav")

  ;; If idle for more than 15 minutes, resolve the things by asking what to do
  ;; with the clock time
  (setq org-clock-idle-time 15)

  ;; change clock default face when overrunning effort
  ;; source: https://www.reddit.com/r/orgmode/comments/aw9lqf/change_the_color_of_a_running_orgmode_timer/
  (set-face-attribute 'org-mode-line-clock-overrun nil :foreground "red2" :weight 'bold)
 
  ;; == Refile ==
  ;; Targets include this file and any file contributing to the agenda - up to 9 levels deep
  (setq org-refile-targets (quote ((nil :maxlevel . 9)
                                   (org-agenda-files :maxlevel . 9))))
  
  ;;  Be sure to use the full path for refile setup
  (setq org-refile-use-outline-path t)
  (setq org-outline-path-complete-in-steps nil)

  ;; Allow refile to create parent tasks with confirmation
  (setq org-refile-allow-creating-parent-nodes 'confirm)

  ;; Exclude DONE state tasks from refile targets
  (setq org-refile-target-verify-function 'bh/verify-refile-target)

  ;; set reminders for deadlines
  (setq org-deadline-warning-days 10)

  ;; == Tags ==
  ;; Auto-update tags whenever the state is changed
  (setq org-todo-state-tags-triggers
        '(("CANCELLED" ("CANCELLED" . t))
          ("WAITING" ("SOMEDAY") ("INACTIVE") ("WAITING" . t))
          ("INACTIVE" ("WAITING") ("SOMEDAY") ("INACTIVE" . t))
          ("SOMEDAY" ("WAITING") ("INACTIVE") ("SOMEDAY" . t))
          (done ("WAITING") ("INACTIVE") ("SOMEDAY"))
          ("TODO" ("WAITING") ("CANCELLED") ("INACTIVE") ("SOMEDAY"))
          ("TASK" ("WAITING") ("CANCELLED") ("INACTIVE") ("SOMEDAY"))
          ("NEXT" ("WAITING") ("CANCELLED") ("INACTIVE") ("SOMEDAY"))
          ("PROJ" ("WAITING") ("CANCELLED") ("INACTIVE") ("SOMEDAY"))
          ("MOTIVATOR" ("WAITING") ("CANCELLED") ("INACTIVE") ("SOMEDAY"))
          ("DONE" ("WAITING") ("CANCELLED") ("INACTIVE") ("SOMEDAY"))))

  ;;  (defun bh/org-auto-exclude-function (tag)
  ;;    "Automatic task exclusion in the agenda with / RET"
  ;;    (and (cond
  ;;          ((string= tag "hold")
  ;;           t)
  ;;          ((string= tag "farm")
  ;;           t))
  ;;         (concat "-" tag)))
  ;;  
  ;;  (setq org-agenda-auto-exclude-function 'bh/org-auto-exclude-function)

)

;; Fix evil-auto-indent for org buffers.
;; source: https://github.com/gjstein/emacs.d/blob/master/config/init-31-doc-org.el 
(defun ey--org-disable-evil-auto-indent nil
  "Disables evil's auto-indent for org."
  (setq evil-auto-indent nil)
)

(defun column-delimiter (n_char) 
  (progn
   (setq display-fill-column-indicator-column n_char)
   (setq display-fill-column-indicator "t")
   (display-fill-column-indicator-mode)
  )
)

(use-package org
  ;;  ;;:straight (:type built-in)
  ;;:straight (:local-repo nil)
  :defer 2
  :init
  ;; set line wrap at 90 characters
  (add-hook 'org-mode-hook 
    '(lambda () (column-delimiter 90))
  )

  ;; disable evil-auto-indent on org buffers - it reindents 
  ;; every time you add a new line with `o` or `i` + RET
  (add-hook 'org-mode-hook #'ey--org-disable-evil-auto-indent)

  ;; == Agenda Specific Hooks == 

  ;; Agenda post-processing
  ;; Highlight the "!!" for stuck projects (for emphasis)
  (add-hook 'org-agenda-finalize-hook 'gs/org-agenda-project-highlight-warning)

  ;; Remove empty agenda blocks
  (add-hook 'org-agenda-finalize-hook 'gs/remove-agenda-regions)

  :config
  ;; Set org default directories
  (ey--load-org-directory)

  ;; Highlight latex code 
  (setq org-highlight-latex-and-related '(latex script entities))
  
  ;; Display inline images
  (setq org-startup-with-inline-images t)


  ;; change display of verbatim to red highlight
  (add-to-list 'org-emphasis-alist
               '("=" (:foreground "red")
                 ))

  ;; set agenda config
  ;;(setq org-agenda-files '("~/notes/to-do-list.org"))
  (ey--load-org-agenda)

  ;; Toggle smart quotes (org-export-with-smart-quotes).
  ;; Depending on the language used, when activated, 
  ;; Org treats pairs of double quotes as primary quotes, 
  ;; pairs of single quotes as secondary quotes, and single quote marks as apostrophes. 
  (setq org-export-with-smart-quotes t)

  ;; load latex packages for preview
  (ey--load-org-latex-packages)

  ;; babel config
  (ey--load-org-babel-config)
  (ey--load-org-babel-templates)

  ;; org capture templates 
  (ey--load-org-capture-templates)

  ;; Edit size of inline preview of images in latex
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))

 (defun hello ()
      "Hello World and you can call it via M-x hello."
      (interactive)
      (message "Hello World!"))
)
