emacs/init.el

(defun ey-open-config () 
(interactive) (find-file "~/.emacs.d/config.org")
)

(defun ey-open-agenda () 
(interactive) (find-file "~/notes/to-do-list.org")
)

(defun ey-open-current-project () 
(interactive) (find-file "/docker:root@ab24f147537c:/home/eliasy/project_repositories")
)


(use-package hydra 
  :defer t
  :bind
  (
  ( "M-," . hydra-complete/body)
  ( "M-i" . hydra-helm-swoop/body)
  ( "M-0" . hydra-treemacs/body)
  )
  :config
  ;;:bind (("C-tab" . hydra-complete/body))
 ;; (defhydra hydra-org (:color pink
 ;;                      :hint nil)
 ;; "
 ;; ^Mark^             ^Unmark^           ^Actions^          ^Search
 ;; ^^^^^^^^-----------------------------------------------------------------
 ;; _m_: mark          _u_: unmark        _x_: execute       _R_: re-isearch
 ;; _s_: save          _U_: unmark up     _b_: bury          _I_: isearch
 ;; _d_: delete        ^ ^                _g_: refresh       _O_: multi-occur
 ;; _D_: delete up     ^ ^                _T_: files only: % -28`Buffer-menu-files-only
 ;; _~_: modified
 ;; "
 ;;   ("m" Buffer-menu-mark)
 ;;   ("u" Buffer-menu-unmark)
 ;;   ("U" Buffer-menu-backup-unmark)
 ;;   ("d" Buffer-menu-delete)
 ;;   ("D" Buffer-menu-delete-backwards)
 ;;   ("s" Buffer-menu-save)
 ;;   ("~" Buffer-menu-not-modified)
 ;;   ("x" Buffer-menu-execute)
 ;;   ("b" Buffer-menu-bury)
 ;;   ("g" revert-buffer)
 ;;   ("T" Buffer-menu-toggle-files-only)
 ;;   ("O" Buffer-menu-multi-occur :color blue)
 ;;   ("I" Buffer-menu-isearch-buffers :color blue)
 ;;   ("R" Buffer-menu-isearch-buffers-regexp :color blue)
 ;;   ("c" nil "cancel")
 ;;   ("v" Buffer-menu-select "select" :color blue)
 ;;   ("o" Buffer-menu-other-window "other-window" :color blue)
 ;;   ("q" quit-window "quit" :color blue)
 ;; )
 ;; (define-key Buffer-menu-mode-map "," 'hydra-org/body)

  (defhydra hydra-complete (:exit t)
    "
    Complete keybindings
    ^Mark^                        ^Actions^          
    ^^^^^^^^-----------------------------------------------------------------------
    _,_: yankpad-expand                       expand snippet 
    _h_: ess-display-help-on-object           open ess help for object at point
    _r_: ess-eval-region                      execute selection on R buffer
    _j_: dumb-jump-hydra                      go to dumb-jump-hydra
    _c_: comint-clear-buffer                  clear the buffer of the shell/process 
    _d_: hydra-ess-debug                      go to ess-debug hydra
    _p_  hydra-ess-package                    go to ess-package functions
    "

    (","  yankpad-expand)
    ("h"  ess-display-help-on-object)
    ("r"  ess-eval-region)
    ("j"  dumb-jump-hydra/body)
    ("c"  comint-clear-buffer)
    ("d"  hydra-ess-debug/body)
    ("p"  hydra-ess-package/body)
  )

  (defhydra dumb-jump-hydra (:color blue :columns 3)
    "
    dumb-jump keybindings
    ^Mark^                        ^Actions^          
    ^^^^^^^^-----------------------------------------------------------------------
    _g_: dumb-jump-go                                 go to definition           
    _o_: dumb-jump-go-other-window                    definition on new window     
    _e_: dumb-jump-go-prefer-external                 favor definitions in other buffers          
    _x_: dumb-jump-go-prefer-external-other-window    same as above but in a new window    
    _p_: dumb-jump-go-prompt                          asks which function to jump          
    _l_: dumb-jump-quick-look                         show tooltip with the definition           
    _b_: dumb-jump-back                               go back to the point before jump           
    _q_: quit                       
    "

    ("g" dumb-jump-go                              "Go")
    ("o" dumb-jump-go-other-window                 "Other window")
    ("e" dumb-jump-go-prefer-external              "Go    external")
    ("x" dumb-jump-go-prefer-external-other-window "Go    external other window")
    ("p" dumb-jump-go-prompt                       "Prompt")
    ("l" dumb-jump-quick-look                      "Quick look")
    ("b" dumb-jump-back                            "Back")
    ("q"  nil "quit" :color blue)
  )

  (defhydra hydra-ess-debug ()
    "
    Ess-debug keybindings
    ^Mark^                        ^Actions^          
    ^^^^^^^^-----------------------------------------------------------------------
    _c_: ess-debug-command-continue           debug: Continue           
    _m_: ess-debug-command-continue-multi     debug: Continue multi     
    _n_: ess-debug-command-next               debug: Next step          
    _M_: ess-debug-command-next-multi         debug: Next step multi    
    _u_: ess-debug-command-up                 debug: Up frame           
    _t_: ess-debug-command-quit               debug: Quit debugging     
    _q_: quit                       
    "

    ("c"  ess-debug-command-continue)
    ("m"  ess-debug-command-continue-multi)
    ("n"  ess-debug-command-next)
    ("M"  ess-debug-command-next-multi)
    ("u"  ess-debug-command-up)
    ("t"  ess-debug-command-quit)
    ("q"  nil "quit" :color blue)
  )


  (defhydra hydra-ess-package ()
    "
    Ess-debug keybindings
    ^Mark^                        ^Actions^          
    ^^^^^^^^-----------------------------------------------------------------------
    _c_: ess-debug-command-continue           debug: Continue           
    _m_: ess-debug-command-continue-multi     debug: Continue multi     
    _n_: ess-debug-command-next               debug: Next step          

    ^check^                        ^Actions^          
    _c_: ess-r-devtools-check-package
    _w_: ess-r-devtools-check-with-winbuilder
    _r_: ess-r-rhub-check-package

    ^build/load/install^                        ^Actions^          
    _b_: ess-r-devtools-build
    _i_: ess-r-devtools-install-package
    _l_: ess-r-devtools-load-package
    _u_: ess-r-devtools-unload-package

    ^document/test^                        ^Actions^          
    _d_: ess-r-devtools-document-package
    _t_: ess-r-devtools-test-package

    ^other^                        ^Actions^          
    _e_: ess-r-devtools-execute-command
    _v_: ess-r-set-evaluation-env
    _g_: ess-r-devtools-install-github
    _q_: quit                       
    "

    ("c" ess-r-devtools-check-package)
    ("w" ess-r-devtools-check-with-winbuilder)
    ("r" ess-r-rhub-check-package)
    ("b" ess-r-devtools-build)
    ("i" ess-r-devtools-install-package)
    ("l" ess-r-devtools-load-package)
    ("u" ess-r-devtools-unload-package)
    ("d" ess-r-devtools-document-package)
    ("t" ess-r-devtools-test-package)
    ("e" ess-r-devtools-execute-command)
    ("v" ess-r-set-evaluation-env)
    ("g" ess-r-devtools-install-github)
    ("q"  nil "quit" :color blue)
  )

  (defhydra hydra-helm-swoop ()
    "
    Swoop keybindings
    ^Mark^                        ^Actions^          
    ^^^^^^^^-----------------------------------------------------------------------
    _i_: 'helm-swoop               open search at selection/cursor  
    _I_: 'helm-swoop-back          Go to the last pos. where swoop was called   
    _m_: 'helm-multi-swoop         search in all selected buffers    
    _M_: 'helm-multi-swoop-all     search in all buffers   
    _q_: quit                       
    "
    ("i"  helm-swoop)
    ("I"  helm-swoop-back-to-last-point)
    ("m"  helm-multi-swoop)
    ("M"  helm-multi-swoop-all)
    ("q"  nil "quit" :color blue)
  )


  (defhydra hydra-helm ()
    "
    Swoop keybindings
    ^Mark^                        ^Actions^          
    ^^^^^^^^-----------------------------------------------------------------------
    _i_: 'helm-swoop               open search at selection/cursor  
    _I_: 'helm-swoop-back          Go to the last pos. where swoop was called   
    _m_: 'helm-multi-swoop         search in all selected buffers    
    _M_: 'helm-multi-swoop-all     search in all buffers   
    _q_: quit                       
    "
    ("1"  'helm-all-mark-rings)
    ("2"  'helm-register)
    ("2"  'helm-top)
    ("2"  'helm-google-suggest)
    ("q"  nil "quit" :color blue)
  )


  (defhydra hydra-treemacs ()
    "
    Treemacs keybindings
    ^Mark^                                  ^Actions^          
    ^^^^^^^^------------------------------------------------------------------------------
    _0_: 'treemacs-select-window            open search at selection/cursor  
    _t_: 'treemacs                         Go to the last pos. where swoop was called   
    _a_: 'add-and-display-current-project   Go to the last pos. where swoop was called   
    _x_: 'current-project-exclusively       Go to the last pos. where swoop was called   
    _e_: 'treemacs-edit-workspaces          Go to the last pos. where swoop was called   
    _1_: 'treemacs-delete-other-windows     search in all selected buffers    
    _B_: 'treemacs-bookmark                search in all buffers   
    _f_: 'treemacs-find-file               search in all buffers   
    _g_: 'treemacs-find-tag                search in all buffers   
    _r_: 'treemacs-quit                    remove treemacs panel  
    _q_: quit                       
    "
    ("0"     treemacs-select-window)
    ("t"     treemacs)
    ("1"     treemacs-delete-other-windows)
    ("a"     treemacs-add-and-display-current-project)
    ("x"     treemacs-display-current-project-exclusively)
    ("e"     treemacs-edit-workspaces)
    ("B"     treemacs-bookmark)
    ("f"     treemacs-find-file)
    ("g"     treemacs-find-tag)
    ("r"     treemacs-quit)
    ("q"     nil)
  )

  (defhydra hydra-thesaurus ()
    "thesaurus"
    ("a" mw-thesaurus-lookup-at-point)
    ("f" sdcv-search)
    ("q" nil "quit" :color blue)
  )

;;source: https://hungyi.net/posts/hydra-for-evil-mc/
  (defhydra hydra-evil-mc (:color pink
			   :hint nil
			   :pre (evil-mc-pause-cursors))
    "
    ^Match^            ^Line-wise^           ^Manual^
    ^^^^^^-------------------------------------------------------------------------
    _Z_: match all     _J_:   make & go down                    _z_: toggle here
    _m_: make & next   _K_:   make & go up                      _r_: remove last
    _M_: make & prev   _H_:   vertical block                    _R_: remove all
    _n_: skip & next   _gr+_: increase number at each cursor    _p_: pause/resume
    _N_: skip & prev   _gr-_: decrease number at each cursor

    Current pattern: %`evil-mc-pattern

    "
    ("Z"   #'evil-mc-make-all-cursors)
    ("m"   #'evil-mc-make-and-goto-next-match)
    ("M"   #'evil-mc-make-and-goto-prev-match)
    ("n"   #'evil-mc-skip-and-goto-next-match)
    ("N"   #'evil-mc-skip-and-goto-prev-match)
    ("J"   #'evil-mc-make-cursor-move-next-line)
    ("K"   #'evil-mc-make-cursor-move-prev-line)
    ("z"   #'multiple-cursors/evil-mc-toggle-cursor-here)
    ("r"   #'multiple-cursors/evil-mc-undo-cursor)
    ("R"   #'evil-mc-undo-all-cursors)
    ("p"   #'multiple-cursors/evil-mc-toggle-cursors)
    ("H"   evil-mc-make-vertical-cursors)
    ("gr+" evil-mc-inc-num-at-each-cursor) ;; see rectangle-number-lines for an alternative
    ("gr-" evil-mc-dec-num-at-each-cursor)
    ("q"   #'evil-mc-resume-cursors "quit" :color blue)
    ("<escape>" #'evil-mc-resume-cursors "quit" :color blue)
  )


  (defhydra hydra-leader (:exit t)
    "
    Treemacs keybindings
    ^Mark^                                  ^Actions^          
    ^^^^^^^^------------------------------------------------------------------------------
    _n_:    make-frame              
    _TAB_:  yankpad-expand           
    _._:    buffer-menu            
    _d_:    kill-this-buffer       
    _l_:    whitespace-mode      
    _c_:    ey-open-config      
    _w_:    ey-open-current-project     
    _a_:    ey-open-agenda      
    _t_:    hydra-thesaurus/body
    _p_:    hydra-helm-projectile/body  
    _h_:    helm-projectile       
    _qq_:   delete-window         
    _qw_:   kill-buffer-and-window
    _f_:    hydra-evil-mc/body 

    "
    ("n"     make-frame)
    ("TAB"   yankpad-expand)
    ("."     buffer-menu)
    ("d"     kill-this-buffer)
    ("l"     whitespace-mode)  ;; Show invisible characters
    ("c"     ey-open-config )
    ("w"     ey-open-current-project )
    ("a"     hydra-agenda/body)
    ("t"     hydra-thesaurus/body)
    ;; Projectile
    ("p"     hydra-helm-projectile/body)
    ("h"     helm-projectile)
    ("qq"    delete-window)
    ("qw"    kill-buffer-and-window)
    ;; Multiple cursors 
    ("f"     hydra-evil-mc/body)
  ;   ("a"      'org-insert-structure-template)

  )


  (defhydra hydra-helm-projectile ()
    "
    Treemacs keybindings
    ^Mark^                                  ^Actions^          
    ^^^^^^^^------------------------------------------------------------------------------
    _b_:    'helm-projectile-switch-to-buffer     
    _d_:    'helm-projectile-find-dir              
    _f_:    'helm-projectile-find-file           
    _F_:    'helm-projectile-find-file-dwim      
    _h_:    'helm-projectile                   
    _p_:    'helm-projectile-switch-project   
    _r_:    'helm-projectile-recentf          
    _g_:    'helm-projectile-grep             

    "

    ("b"  helm-projectile-switch-to-buffer)
    ("d"  helm-projectile-find-dir)
    ("f"  helm-projectile-find-file)
    ("F"  helm-projectile-find-file-dwim)
    ("h"  helm-projectile)
    ("p"  helm-projectile-switch-project)
    ("r"  helm-projectile-recentf)
    ("g"  helm-projectile-grep)

  )



  (defhydra hydra-agenda ()
    "
    Treemacs keybindings
    ^Mark^                        ^Actions^          
    ^^^^^^^^------------------------------------------------------------------------------
    _t_:  org-todo                   open to-do menu                    
    _a_:  org-agenda	             open agenda          
    _s_:  org-schedule	             set schedule for task          
    _d_:  org-deadline	             set deadline for task          
    _c_:  org-capture	             capture new items
    _i_:  org-clock-in	             clock in to the section you're currently in          
    _o_:  org-clock-out              clock out of whatever you're clocked in to                         
    _g_:   org-clock-goto             jump to whatever headline you are currently clocked in to          
    _r_:  org-refile	             move header to other part of the document 
    _l_:  calendar	             open calendar          
    _v_:  org-columns	             show columns in org-files with the time clocked          
    _z_:  ey-open-agenda             open main agenda file          
    _e_:  org-time-stamp-inactive    activate inactive time stamp
    _f_:  org-set-effort             set effort to complete a task
    "

    ("t"  org-todo)
    ("a"  org-agenda)
    ("s"  org-schedule)
    ("d"  org-deadline)
    ("c"  org-capture)
    ("i"  org-clock-in)
    ("o"  org-clock-out)
    ("g"  org-clock-goto)
    ("r"  org-refile)
    ("l"  calendar)
    ("v"  org-columns)
    ("z"  ey-open-agenda)
    ("e"   org-time-stamp-inactive)
    ("f"   org-set-effort)
    ("q"   #'evil-mc-resume-cursors "quit" :color blue)
    ("<escape>" #'evil-mc-resume-cursors "quit" :color blue)

;; for setting time stamps see this page from the manual:
;; https://orgmode.org/manual/The-date_002ftime-prompt.html

;;Key             Calls                   Action
;;C-c C-x C-i 	org-clock-in            Clock in to the section you're currently in
;;C-c C-x C-o 	org-clock-out           Clock out of whatever you're clocked in to
;;C-c C-x C-x 	org-clock-in-last 	Clock in to the last clocked task
;;C-c C-x C-j 	org-clock-goto          Jump to whatever headline you are currently clocked in to
;;C-c C-x C-q 	org-clock-cancel 	Cancel the current clock (removes all of it's current time)
;;C-c C-x C-d 	org-clock-display 	Display clock times for headlines in current file
;;C-c C-x C-r 	org-clock-report 	Generate a report for clock activity
;;C-c C-x C-z 	org-resolve-clocks 	Resolve any half-open clocks

;; remap
;; org-capture-kill
;; org-capture-refile
;; org-capture-finalize

;;(global-set-key (kbd "<f9> t") 'bh/insert-inactive-timestamp)
;;(global-set-key (kbd "<f9> T") 'bh/toggle-insert-inactive-timestamp)
  )





)
