emacs/init.el

(use-package undo-tree
  :init
  (global-undo-tree-mode 1) ;; to use evil-undo, evil-redo
)

(use-package evil
  :init 
  ;; these parameters are required for evil collection
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-want-keybinding nil)
  :hook 
  ;; add code folding
  ('prog-mode . #'hs-minor-mode)
  ;; ('c-mode-common-hook   . 'hs-minor-mode)
  ;; ('emacs-lisp-mode-hook . 'hs-minor-mode)
  ;; ('java-mode-hook       . 'hs-minor-mode)
  ;; ('lisp-mode-hook       . 'hs-minor-mode)
  ;; ('perl-mode-hook       . 'hs-minor-mode)
  ;; ('sh-mode-hook         . 'hs-minor-mode)
  :bind
  (
  :map evil-normal-state-map
  ("," . 'hydra-leader/body)
  ("M-." . 'xref-find-definitions)
  :map evil-visual-state-map
  ("," . 'hydra-leader/body)
  )
  :config
  (evil-mode 1)
  ;; allows pasting from the register
  (evil-select-search-module 'evil-search-module 'evil-search)
  (evil-set-undo-system 'undo-tree)
;;  (evil-define-key 'normal 'global "," 'hydra-leader/body)
;;  (evil-define-key 'normal 'global (kbd "SPC") 'hydra-leader/body)

;;   in case I wish to edit folding manually
;;   (setq evil-fold-list
;;         '(((hs-minor-mode)
;;            :open-all hs-show-all 
;;            :close-all hs-hide-all 
;;            :toggle hs-toggle-hiding 
;;            :open hs-show-block 
;;            :open-rec nil 
;;            :close hs-hide-block 
;;            :close-level my-hs-hide-level)
;;           )
;;   )

;;   folding backends available
;;   vdiff-mode
;;   vdiff-3way-mode
;;   hs-minor-mode
;;   hide-ifdef-mode
;;   outline-mode
;;   origami-mode

)




;; add and change delimiters
(use-package evil-surround
 :after evil
 :config
 (global-evil-surround-mode 1)
)

;; jump between delimiters
(use-package evil-matchit 
  :after evil
  :config
 (global-evil-matchit-mode 1)
)

;; comment lines
(use-package evil-commentary 
  :after evil
)

;; improve search
;;(use-package evil-anzu 
;;  :after evil
;;;;  :config
;;  (global-anzu-mode +1)
;;)

;; better way to jump to word
(use-package evil-snipe 
  :after evil
  :config
  (evil-snipe-mode +1)
  ;;(evil-snipe-override-mode +1) ;; this messes finding with multiple cursors in evil-mc
  (add-hook 'magit-mode-hook 'turn-off-evil-snipe-override-mode)
  (setq evil-snipe-scope 'line)
  (setq evil-snipe-repeat-scope 'buffer)
  (setq evil-snipe-spillover-scope 'buffer)
)

;; realign blocks of text
(use-package evil-lion
  :after evil
  :config
  (evil-lion-mode)
)

;; work with blocks of text
(use-package evil-indent-plus 
  :after evil
  :config
  (evil-indent-plus-default-bindings)
)

;; keybindings for evil almost everywhere
(use-package evil-collection
  :after evil
  :straight (evil-collection :type git :flavor melpa :host github :repo "emacs-evil/evil-collection"
              :fork (:host github :files (:defaults "modes" "evil-collection-pkg.el") :repo "nettoyoussef/evil-collection"))
  :custom (evil-collection-setup-minibuffer t)
  :config
  (evil-collection-init)
)

;; makes evil play nicer with org
(use-package evil-org
  :after org evil
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
    (lambda ()
     ;; navigation conflicts with evil-lion
     (evil-org-set-key-theme '(textobjects additional))
    )
  )
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)
)

;;use evil-scape instead of my command with C-c 
(use-package evil-exchange
  :after evil
  :config
  (evil-exchange-install)
)

;;use evil-scape instead of my command with C-c 
(use-package evil-escape
  :after evil
  :bind
;  (
  ;;("fd" . evil-escape-key-sequence)
;  )
  :config
  (evil-escape-mode)
  (setq-default evil-escape-key-sequence "fd")
  (setq-default evil-escape-delay 0.1)
)

;; use ["+]griw to substitute word with
;; register "+.  
(use-package evil-replace-with-register 
  :after evil
  :config
  ;; change default key bindings (if you want) HERE
  (setq evil-replace-with-register-key (kbd "gr"))
  (evil-replace-with-register-install)
)

;; invert shift behavior for keyboard on the number line
;; S-1 becomes 1 and 1 becomes !
;; other swaps are available, but these were the most interesting
;;(use-package evil-swap-keys 
;;;;  :after evil
;;  :config
;;  (global-evil-swap-keys-mode)
;;  (add-hook 'prog-mode-hook #'evil-swap-keys-swap-number-row)
;;)

;;; C-c as general purpose escape key sequence.
;;; source: https://www.emacswiki.org/emacs/Evil
;;;
(defun my-esc (prompt)
  "Functionality for escaping generally.  Includes exiting Evil insert state and C-g binding. "
  (cond
   ;; If we're in one of the Evil states that defines [escape] key, return [escape] so as
   ;; Key Lookup will use it.
   ((or (evil-insert-state-p) (evil-normal-state-p) (evil-replace-state-p) (evil-visual-state-p)) [escape])
   ;; This is the best way I could infer for now to have C-c work during evil-read-key.
   ;; Note: As long as I return [escape] in normal-state, I don't need this.
   ;;((eq overriding-terminal-local-map evil-read-key-map) (keyboard-quit) (kbd ""))
   (t (kbd "C-g"))))
(define-key key-translation-map (kbd "C-c") 'my-esc)
;; Works around the fact that Evil uses read-event directly when in operator state, which
;; doesn't use the key-translation-map.
(define-key evil-operator-state-map (kbd "C-c") 'keyboard-quit)
;; Not sure what behavior this changes, but might as well set it, seeing the Elisp manual's
;; documentation of it.
;(set-quit-char "C-c")
; this last line doesn't work - error: 'QUIT must be an ASCI code.'

;; Altering the functioning of q
;; source: https://www.reddit.com/r/spacemacs/comments/6p3w0l/making_q_not_kill_emacs/
;; :q should kill the current buffer rather than quitting emacs entirely
(evil-ex-define-cmd "q" 'kill-this-buffer)
;; Need to type out :quit to close emacs
(evil-ex-define-cmd "quit" 'evil-quit)
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages (quote (evil))))

;; Display relative numbers
;; source: https://github.com/noctuid/evil-guide
(setq-default display-line-numbers 'visual
              display-line-numbers-widen t
              ;; this is the default
              display-line-numbers-current-absolute t)

(defun noct:relative ()
  (setq-local display-line-numbers 'visual))

(defun noct:absolute ()
  (setq-local display-line-numbers t))

(add-hook 'evil-insert-state-entry-hook #'noct:absolute)
(add-hook 'evil-insert-state-exit-hook #'noct:relative)

(use-package expand-region
  :defer t
  :bind
  (("M-n" . 'er/expand-region))
  :config
  (defun er/add-text-mode-expansions ()
(make-variable-buffer-local 'er/try-expand-list)
(setq er/try-expand-list (append
		    er/try-expand-list
		    '(mark-paragraph
		      mark-page))))

  (add-hook 'text-mode-hook 'er/add-text-mode-expansions)
)
