emacs/config.org
** Multiple-cursors with evil-mc and evil-iedit-state

#+BEGIN_SRC emacs-lisp   
  (use-package evil-mc 
  ;; doesnt work well with defer, it doesnt autoload in the correct time  
  ;; :defer 2 
   :bind
   (
    :map evil-mc-cursors-map
    ("m" . nil) 
    ("u" . nil) 
    ("q" . nil) 
    ("s" . nil) 
    ("r" . nil) 
    ("f" . nil) 
    ("l" . nil) 
    ("h" . nil) 
    ("j" . nil) 
    ("k" . nil) 
    ("N" . nil) 
    ("P" . nil) 
    ("n" . nil) 
    ("p" . nil) 
    ("I" . nil) 
    ("A" . nil) 
   )
   :config
   (global-evil-mc-mode  1) ;; enable

  ;; the functions below help to edit several lines in a paragraph
  ;; by making vip + ,fH + edits + ,fR
  ;; source: https://github.com/syl20bnr/spacemacs/issues/2669#issuecomment-273356499
   (defun evil--mc-make-cursor-at-col (startcol _endcol orig-line)
     (move-to-column startcol)
     (unless (= (line-number-at-pos) orig-line)
       (evil-mc-make-cursor-here)
     )
   )

   ;;; During visual selection point has +1 value
   ;; modified from:
   ;; https://github.com/syl20bnr/spacemacs/issues/2669#issuecomment-273356499
   ;; original source: https://github.com/syl20bnr/spacemacs/issues/2669#issuecomment-422022560
   ;; other versions: https://github.com/gabesoft/evil-mc/issues/22#issuecomment-273352904
   (defun evil-mc-make-vertical-cursors (beg end)
     ;;; Because `evil-mc-resume-cursors` produces a cursor,
     ;;; we have to skip a current line here to avoid having +1 cursor
     (interactive (list (region-beginning) (- (region-end) 1)))
     (evil-exit-visual-state)
     (evil-mc-pause-cursors)
     (apply-on-rectangle #'evil--mc-make-cursor-at-col
                         beg end (line-number-at-pos))
     (evil-mc-resume-cursors)
      ;;; Because `evil-mc-resume-cursors` produces a cursor, we need to place it on on the
      ;;; same column as the others
     (move-to-column (evil-mc-column-number 0))
   )
)

  (use-package evil-mc-extras
   :defer t
   :config
   (global-evil-mc-extras-mode  1)
  )

  (use-package iedit 
  )

  ;; this package requires 
  ;; expand region to work well
  (use-package evil-iedit-state 
  )
 #+END_SRC

* Appearance customization 
** Icons - use all-the-icons

#+BEGIN_SRC emacs-lisp   
(use-package all-the-icons
  :defer t
)
#+END_SRC
** Colors - doom themes
The solaire-mode is used to change colors of sidebars vs main buffer.

#+BEGIN_SRC emacs-lisp   

;; A more complex, more lazy-loaded config
(use-package solaire-mode
  ;; Ensure solaire-mode is running in all solaire-mode buffers
  :hook (change-major-mode . turn-on-solaire-mode)
  ;; ...if you use auto-revert-mode, this prevents solaire-mode from turning
  ;; itself off every time Emacs reverts the file
  :hook (after-revert . turn-on-solaire-mode)
  ;; To enable solaire-mode unconditionally for certain modes:
  :hook (ediff-prepare-buffer . solaire-mode)
  ;; Highlight the minibuffer when it is activated:
  :hook (minibuffer-setup . solaire-mode-in-minibuffer)
  :config
  ;; The bright and dark background colors are automatically swapped the first 
  ;; time solaire-mode is activated. Namely, the backgrounds of the `default` and
  ;; `solaire-default-face` faces are swapped. This is done because the colors 
  ;; are usually the wrong way around. If you don't want this, you can disable it:
  ;; basically, this reverts what is bright and what is dark
  ;;(setq solaire-mode-auto-swap-bg nil)

  (solaire-global-mode +1)
)

(use-package doom-themes 
  :config
  (load-theme 'doom-gruvbox t)
  ;;(load-theme 'doom-tomorrow-night t)
  (setq doom-themes-enable-bold t)    ; if nil, bold is universally disabled
  (setq doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (doom-themes-org-config)
)
#+END_SRC

** (INACTIVE) set colors automatically with ewal

Just copied the default config from the author,
available here:
https://github.com/wurosh/ewal

#+BEGIN_SRC emacs-lisp   
;;(use-package ewal
;;  :init (setq ewal-use-built-in-always-p nil
;;              ewal-use-built-in-on-failure-p t
;;              ewal-built-in-palette "sexy-material"))
;;
;;(use-package ewal-spacemacs-themes
;;  :init (progn
;;          (setq spacemacs-theme-underline-parens t
;;                my:rice:font (font-spec
;;                              :family "Source Code Pro"
;;                              :weight 'semi-bold
;;                              :size 11.0))
;;          (show-paren-mode +1)
;;          (global-hl-line-mode)
;;          (set-frame-font my:rice:font nil t)
;;          (add-to-list  'default-frame-alist
;;                        `(font . ,(font-xlfd-name my:rice:font))))
;;  :config (progn
;;            (load-theme 'ewal-spacemacs-modern t)
;;            (enable-theme 'ewal-spacemacs-modern)))
;;(use-package ewal-evil-cursors
;;  :after (ewal-spacemacs-themes)
;;  :config (ewal-evil-cursors-get-colors
;;           :apply t :spaceline t))
;;(use-package spaceline
;;  :after (ewal-evil-cursors winum)
;;  :init (setq powerline-default-separator nil)
;;  :config (spaceline-spacemacs-theme))

#+END_SRC
** Highlight brackets according to their depth
#+BEGIN_SRC emacs-lisp   
(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
 )
 #+END_SRC
 
** Highlight indentation
#+BEGIN_SRC emacs-lisp   
(use-package highlight-indent-guides 
  :defer t
  :config
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
  (add-hook 'org-mode-hook 'highlight-indent-guides-mode)
  (setq highlight-indent-guides-method 'character) ;; highlights indentation with lines
 )
 #+END_SRC
** Modeline
*** Doom modeline 

 #+BEGIN_SRC emacs-lisp   
(use-package doom-modeline
  :init (doom-modeline-mode 1))

;; Or use this
;; Use `window-setup-hook' if the right segment is displayed incorrectly
(use-package doom-modeline
  :hook (after-init . doom-modeline-mode))
 #+END_SRC

** Long lines in org mode

Just run the command:
visual-line-mode

* Helm
** Install and configure Helm

A excellent guide on how to use helm:
https://tuhdo.github.io/helm-intro.html
   
#+BEGIN_SRC emacs-lisp   
;; Enable and install helm
(use-package helm
  :bind
  (("C-x b"    . helm-mini)
   ("M-x"      . helm-M-x)
   ("C-x C-f"  . helm-find-files)
   ("C-h c"    . helm-apropos)
;;   ("C-:"      . helm-lisp-completion-at-point-company)
   :map helm-find-files-map
   ("C-k"      . helm-find-files-up-one-level))
  :config
  (helm-mode 1)
  (setq helm-autoresize-mode t)
  (setq helm-buffer-max-length 40)
  (setq helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match    t)
  (setq helm-apropos-fuzzy-match t)
  (setq helm-split-window-inside-p t)

;; How to avoid helm to split windows? See below where the behavior started
;;source: https://github.com/emacs-helm/helm/issues/1860
;;source: https://www.reddit.com/r/emacs/comments/bbqc67/helmprojectile_trouble_with_opening_multiple/

;;  (define-key helm-map (kbd "S-SPC") 'helm-toggle-visible-mark)
;; :map helm-map
;;([tab] . helm-next-line)
;;([backtab] . helm-previous-line) 
;;(define-key helm-map (kbd "<tab>")    'helm-execute-persistent-action)
;;(define-key helm-map (kbd "<backtab>") 'helm-select-action)
)
#+END_SRC

** Install projectile 

#+BEGIN_SRC emacs-lisp   
      ;; Enable and install projectile
(use-package projectile
 :defer t
 :bind
 (:map projectile-mode-map
 ("s-p" . projectile-command-map))
 :config
 (projectile-global-mode)
 (setq projectile-switch-project-action 'helm-projectile) ;; requires helm-projectile
)
 #+END_SRC

** Install helm-projectile 
#+BEGIN_SRC emacs-lisp   
(use-package helm-projectile
;;  :bind
;;  (("C-S-P" . helm-projectile-switch-project)
;;   :map evil-normal-state-map
;;   ("C-p" . helm-projectile))
  :defer t
  :config 
  (helm-projectile-on)
)
 #+END_SRC

** Install Helm-tramp
Add the function "helm-tramp" to make easier to search containers.
#+BEGIN_SRC emacs-lisp   
(use-package helm-tramp
  :defer t
 )
#+END_SRC

* Search mechanisms
