emacs/init.el

(use-package deadgrep
  :commands (deadgrep)
;;  :general (:keymaps 'deadgrep-mode-map "C-c C-w" #'deadgrep-edit-mode)

 ;; :preface
 ;; (defun config-editing--deadgrep-requery ()
 ;;   (interactive)
 ;;   (let ((button (save-excursion
 ;;                   (goto-char (point-min))
 ;;                   (forward-button 1))))
 ;;     (button-activate button)))
 ;; :general (:states 'normal :keymaps 'deadgrep-mode-map "c" #'config-editing--deadgrep-requery)

 ;; :preface
 ;; (defun config-editing--on-enter-deadgrep-edit-mode (&rest _)
 ;;   (message "Entering edit mode. Changes will be made to underlying files as you edit."))
 ;; :config
 ;; (advice-add #'deadgrep-edit-mode :after #'config-editing--on-enter-deadgrep-edit-mode)

 ;; :preface
 ;; (defun config-editing--on-exit-deadgrep-edit-mode (&rest _)
 ;;   (when (derived-mode-p 'deadgrep-edit-mode)
 ;;     (message "Exiting edit mode.")))
 ;; :config
 ;; (advice-add #'deadgrep-mode :before #'config-editing--on-exit-deadgrep-edit-mode)

 ;; :preface
 ;; (defun deadgrep-from-ivy ()
 ;;   (interactive)
 ;;   (ivy-exit-with-action
 ;;    (lambda (&rest _)
 ;;      (let ((deadgrep--search-type 'regexp))
 ;;        (deadgrep (replace-regexp-in-string (rx (+ space)) ".*?" ivy-text))))))
 ;; :init
 ;; (general-define-key :keymaps 'counsel-ag-map "C-c C-e" #'deadgrep-from-ivy))
)

;; repo
;; https://github.com/emacs-helm/helm-recoll
(use-package helm-recoll
  :commands helm-recoll
  :init (setq helm-recoll-directories
	      '(("notes"  . "~/.recoll/notes")
		("zotero" . "~/.recoll/zotero")
               )
        )
)

(use-package company 
 :config
 (add-hook 'after-init-hook 'global-company-mode)
)

(use-package company-statistics
 :defer t
 :config
 (company-statistics-mode)
)

(use-package ess 
 ;;:bind
 ;;(
  ;; add some basic evil functionality on help buffers
  ;;:map  ess-r-help-mode-map 
  ;;("h" . 'evil-backward-char)
  ;;("l" . 'evil-forward-char)
  ;;("j" . 'evil-next-line)
  ;;("k" . 'evil-previous-line)
  ;;("H" . #'ess-display-help-on-object)
  ;;("I" . #'ess-display-package-index)
  ;;("L" . #'ess-eval-line-visibly-and-step)
  ;;("v" . 'evil-visual-char)
  ;;("V" . 'evil-visual-line) 
  ;;("y" . 'evil-yank)
  ;;("Y" . 'evil-yank-line)
  ;;("T" . #'ess-display-vignettes)
 ;;)
 :defer t
 :init 
 ;;(add-hook 'ess-mode-hook (lambda () (local-set-key "\t" 'self-insert-command)))
 (add-hook 'ess-mode-hook 
   (lambda ()  
     (define-key ess-r-help-mode-map "h" 'evil-backward-char)
     (define-key ess-r-help-mode-map "l" 'evil-forward-char)
     (define-key ess-r-help-mode-map "j" 'evil-next-line)
     (define-key ess-r-help-mode-map "k" 'evil-previous-line)
     (define-key ess-r-help-mode-map "H" #'ess-display-help-on-object)
     (define-key ess-r-help-mode-map "I" #'ess-display-package-index)
     (define-key ess-r-help-mode-map "L" #'ess-eval-line-visibly-and-step)
     (define-key ess-r-help-mode-map "v" 'evil-visual-char)
     (define-key ess-r-help-mode-map "V" 'evil-visual-line)
     (define-key ess-r-help-mode-map "y" 'evil-yank)
     (define-key ess-r-help-mode-map "Y" 'evil-yank-line)
     (define-key ess-r-help-mode-map "T" #'ess-display-vignettes)
     (define-key ess-r-help-mode-map "\C-w" #'evil-window-next)
     (define-key ess-r-help-mode-map "gg" 'evil-goto-first-line)
     (define-key ess-r-help-mode-map "G"  'evil-goto-line)
   )
)

  ;; disable the fancy comments feature
  ;; with fancy comments, comments are aligned
  ;; accordingly to the number of # in the line
  ;; ### - beginning of the line
  ;; ## - to the current block of indentation
  ;; # - aligned to the right, 40th column by default
  ;; the value 40th can be changed on the variable
  ;; comment-column
  ;; must be set before initialization,
  ;; see
  ;; https://stackoverflow.com/questions/780796/emacs-ess-mode-tabbing-for-comment-region
  ;; https://stackoverflow.com/a/53458839/7233796
  (setq ess-indent-with-fancy-comments nil)

  ;; remove underible mappings
  ;;(unbind-key "h" ess-r-help-mode-map)
  ;;(unbind-key "l" ess-r-help-mode-map)
  ;;(unbind-key "k" ess-r-help-mode-map) 
  ;;(unbind-key "v" ess-r-help-mode-map)

 :config
 ;;(ess-toggle-underscore nil)
 (setq ess-eval-visibly 'nowait)

  ;; Layout style / window configuration
  ;; source: [[https://ess.r-project.org/Manual/ess.html#Controlling-buffer-display]]
  ;; The following snippet configures the layout of ESS the same way that Rstudio does:    
  (setq display-buffer-alist
        `(("*R Dired"
           (display-buffer-reuse-window display-buffer-in-side-window)
           (side . right)
           (slot . -1)
           (window-width . 0.33)
           (inhibit-same-window . t)
           (reusable-frames . nil))
          ("*R"
           (display-buffer-reuse-window display-buffer-at-bottom)
           (window-width . 0.33)
           (inhibit-same-window . t)
           (reusable-frames . nil)
           (dedicated . t)
          )
          ("*Help"
           (display-buffer-reuse-window display-buffer-in-side-window)
           (side . right)
           (slot . 1)
           (window-width . 0.33)
           (reusable-frames . nil))
         )
  )
  ;; makes emacs scroll down automatically to the end of buffer
  (setq comint-scroll-to-bottom-on-input t)
  (setq comint-scroll-to-bottom-on-output t)
  (setq comint-move-point-for-output t)

  
  ;; The snippet below start up the inferior process and the source code in different frames
  ;;(setq display-buffer-alist
  ;;      '(("*R"
  ;;         (display-buffer-reuse-window display-buffer-pop-up-frame)
  ;;         (reusable-frames . 0))))


)

;; (ess :variables
;;     ess-r-backend 'lsp
;;     ess-style 'RStudio
;;     ess-use-flymake nil
;;     ess-assign-key "\M--")

;;source: https://stat.ethz.ch/pipermail/ess-help/2017-April/012252.html
;; strange error: symbol value as variable is void: ess-r-customize-alist
;;(defun R-docker ()
;;  (interactive)
;;  (let ((ess-r-customize-alist
;;         (append ess-r-customize-alist
;;                 '((inferior-ess-program . "/docker:root@docker_r_r_temp_1:/home/eliasy/"))))
;;        (ess-R-readline t))
;;    (R))
;;)

;(use-package ess-R-data-view 
;; :defer t
;)

(use-package ess-view-data 
;; :defer t
)

(use-package aggressive-indent
  :config
  ;;(add-hook 'ess-mode-hook #'aggressive-indent-mode)
  ;;(add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
  (add-hook 'prog-mode-hook #'aggressive-indent-mode) ;; set for all programing languages
)
