emacs/init.el

(defvar untabify-var)
(make-variable-buffer-local 'untabify-var) ;; this makes the variable buffer-local 

(defun toggle-untabify()
   "Change the current buffer to an untabified buffer"
    (if untabify-var (setq 'untabify-var nil) (setq 'untabify-var t))
)

(defun prog-mode-untabify ()
  "Untabify and remove trailing whitespace if untabify-var is true"
  (if untabify-var
      (save-excursion
        (delete-trailing-whitespace)
        (untabify (point-min) (point-max))
      )
  )
)

(add-hook 'prog-mode-hook 
 '(lambda()
    (setq-default indent-tabs-mode nil) ;; never use tabs in prog mode
    (setq backward-delete-char-untabify-method 'hungry) ;; never delete one space of a tab at a tab, delete a tab whole
    (setq untabify-var t) ;; this sets the buffer to remove trailling whitespace and tabs
 )
)  
(add-hook 'before-save-hook #'prog-mode-untabify) ;; change tabs to spaces and removes trailling whitespace

(add-hook 'prog-mode-hook 
  '(lambda () (column-delimiter 80))
)

;; emacs-lsp main package
(use-package lsp-mode
  :defer t
  :bind  
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  ;; (("s-l" . lsp-keymap-prefix))
;;     :hook 
;;     ;;  ;; replace XXX-mode with concrete major-mode(e. g. python-mode)
;;     (
;;      (R-mode . lsp)
;;      (ess-r-mode . lsp)
;;      (python-mode . lsp)
;;      ;; if you want which-key integration
;;      (lsp-mode . lsp-enable-which-key-integration)
;;      )
;;     ;; see also the spacemacs config with ess + lsp
;;     ;; https://develop.spacemacs.org/layers/+lang/ess/README.html
;;     ;; (add-hook 'R-mode-hook #'lsp-R-enable)
;;    :commands lsp
    :config 
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-l")


    ;; https://www.reddit.com/r/spacemacs/comments/alleyn/ess_completion_without_loading_into_r/
    (lsp-register-client
     (make-lsp-client 
      :new-connection (lsp-stdio-connection '("R" "--slave" "-e" "languageserver::run()"))
      :major-modes '(ess-r-mode)
      :remote? t
      :server-id 'lsp-R))

    ;; (lsp-register-client
    ;;  (make-lsp-client
    ;;   :new-connection (lsp-tramp-connection (lambda () (cons "/home/jwh/bin/ccls" ccls-args)))
    ;;   :major-modes '(ess-r-mode)
    ;;   :server-id 'ccls-remote
    ;;   :multi-root nil
    ;;   :remote? t
    ;;   :notification-handlers
    ;;   (lsp-ht ("$ccls/publishSkippedRanges" #'ccls--publish-skipped-ranges)
    ;;    ("$ccls/publishSemanticHighlight" #'ccls--publish-semantic-highlight))
    ;;   :initialization-options (lambda () ccls-initialization-options)
    ;;   :library-folders-fn nil))


    ;; increase Emacs cache for garbage collection
    ;; The default setting is too low for lsp-mode's 
    ;; needs due to the fact that client/server communication 
    ;; generates a lot of memory/garbage. You have two options:
    ;; (setq gc-cons-threshold 100000000)

    ;; Increase the amount of data which Emacs reads from the 
    ;; process. Again the emacs default is too low 4k 
    ;; considering that the some of the language server 
    ;; responses are in 800k - 3M range.
    (setq read-process-output-max (* 1024 1024)) ;; 1mb

    ;; use company-capf as the completion provider
    (setq lsp-completion-provider :capf)

    ;; Optional: fine-tune lsp-idle-delay. This variable 
    ;; determines how often lsp-mode will refresh the 
    ;; highlights, lenses, links, etc while you type.
    (setq lsp-idle-delay 0.100)

    ;; disable other UI options
    ;; (setq lsp-keep-workspace-alive nil)
    ;; (setq lsp-signature-auto-activate nil)
    ;; (setq lsp-modeline-code-actions-enable nil)
    ;; (setq lsp-modeline-diagnostics-enable nil)
    ;; (setq lsp-enable-file-watchers nil)
    ;; (setq lsp-enable-folding nil)
    ;; (setq lsp-enable-semantic-highlighting nil)
    ;; (setq lsp-enable-symbol-highlighting nil)
    ;; (setq lsp-enable-text-document-color nil)
    ;; (setq lsp-enable-indentation nil)
    ;; (setq lsp-enable-on-type-formatting nil)

    )

;; optionally
(use-package lsp-ui
  :defer t
  :commands lsp-ui-mode
  )

;; optionally if you want to use debugger
(use-package dap-mode
  :defer t
  )

;; if you are helm user
(use-package helm-lsp 
  :defer t
  :commands helm-lsp-workspace-symbol
  )
;; if you are ivy user
;;(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

;; tremacs compatibility
;;(use-package lsp-treemacs 
;;;;  :commands lsp-treemacs-errors-list
;;  )
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

(use-package helm-company
 :defer t
 :bind
 (
  ("C-:" . 'helm-company)
 )
)

(use-package poly-markdown 
 :defer t
 :config

 ;; MARKDOWN
 (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))

 ;; R modes
 (add-to-list 'auto-mode-alist '("\\.Snw" . poly-noweb+r-mode))
 (add-to-list 'auto-mode-alist '("\\.Rnw" . poly-noweb+r-mode))
 (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown+r-mode))

)

(use-package poly-R
 :defer t
)

(use-package flycheck
  :defer t
  :config (global-flycheck-mode)
)

(use-package helm-ag
 :defer t
 :config
 ;; configuration to use rg as main search engine
 (custom-set-variables
  '(helm-ag-base-command "rg --vimgrep --no-heading --smart-case")
  `(helm-ag-success-exit-status '(0 2)))
)

(use-package helm-swoop 
 :defer t
 :bind
 ;; Move up and down like isearch
 (
;; Change the keybinds to whatever you like :D
;;     ("M-i"       . 'helm-swoop)
;;     ("M-I"       . 'helm-swoop-back-to-last-point)
;;     ("C-c M-i"   . 'helm-multi-swoop)
;;     ("C-x M-i"   . 'helm-multi-swoop-all)
  :map helm-swoop-map
  ("C-p"     . 'helm-previous-line)
  ("C-n"     . 'helm-next-line)
  ("M-m"     . 'helm-multi-swoop-current-mode-from-helm-swoop)
  :map helm-multi-swoop-map
  ("C-p"     . 'helm-previous-line)
  ("C-n"     . 'helm-next-line)
  :map helm-swoop--basic-map
  ("C-s"     . 'helm-swoop-edit)
  :map helm-multi-swoop--basic-map
  ("C-s"     . 'helm-multi-swoop-edit)
  :map helm-swoop-edit-map
  ("C-s"     . 'helm-swoop--edit-complete)
  ("C-g"     . 'helm-swoop--edit-cancel)
  :map helm-multi-swoop-edit-map
  ("C-s"     . 'helm-multi-swoop--edit-complete)
  ("C-g"     . 'helm-multi-swoop--edit-cancel)
 )
 :config
 ;; From helm-swoop to helm-multi-swoop-all
 ;;(define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)
 ;; When doing evil-search, hand the word over to helm-swoop
 ;; (define-key evil-motion-state-map (kbd "M-i") 'helm-swoop-from-evil-search)

 ;; Instead of helm-multi-swoop-all, you can also use helm-multi-swoop-current-mode
 ;(define-key helm-swoop-map (kbd "M-m") 'helm-multi-swoop-current-mode-from-helm-swoop)

 ;; Save buffer when helm-multi-swoop-edit complete
 (setq helm-multi-swoop-edit-save t)

 ;; If this value is t, split window inside the current window
 (setq helm-swoop-split-with-multiple-windows t)

 ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
 (setq helm-swoop-split-direction 'split-window-horizontally)

 ;; If nil, you can slightly boost invoke speed in exchange for text color
 (setq helm-swoop-speed-or-color nil)

 ;; ;; Go to the opposite side of line from the end or beginning of line
 (setq helm-swoop-move-to-line-cycle t)

 ;; Optional face for line numbers
 ;; Face name is `helm-swoop-line-number-face`
 (setq helm-swoop-use-line-number-face t)

 ;; If you prefer fuzzy matching
 (setq helm-swoop-use-fuzzy-match t)

)

;; Enable and install magit
