emacs/config.org
** Go-to definition with dumb-jump and xref

For languages that are supported by etags/ctags and the like,
once the tags are generated you can find them by using the command =xref-find-definitions=.
This also work out-of-the-box with Emacs ESS.
In evil, you can do this using the hotkey `gd` while on normal mode.

FOR non-compiled languages, or languages that don't support xref, we have dumb-jump.

#+BEGIN_SRC emacs-lisp   
;; Enable and install magit
(use-package dumb-jump 
  :hook
  (('xref-backend-functions . #'dumb-jump-xref-activate))
  :defer t
  :config 
  ;;(setq dumb-jump-prefer-searcher 'rg)
  ;;(dumb-jump-mode)
)

 #+END_SRC
 
* Git Version Control with magit 
#+BEGIN_SRC emacs-lisp   
;; Enable and install magit
(use-package magit
  :defer t
)

 #+END_SRC
 
* Ivy Search
Basically installing Ivy also since org-ref requires it. 

#+BEGIN_SRC emacs-lisp   
(use-package ivy
  :defer t
)
 #+END_SRC
 
* Ranger - The console file manager 

This is handy package that ports some of ranger functionalities to Dired.

#+BEGIN_SRC emacs-lisp   
(use-package ranger 
  :defer t
  :config

  ;; panel configuration
  (setq ranger-parent-depth 1)
  (setq ranger-width-preview 0.5)
  (setq ranger-width-parents 0.12)
  (setq ranger-max-parent-width 0.12)

  ;; show hidden files
  (setq ranger-show-hidden t)

  ;; set ranger for previewing files
  (setq ranger-preview-file t)

  ;; maximum size of files for preview - in mb
  (setq ranger-max-preview-size 10)

  ;; dont show binary files
  (setq ranger-dont-show-binary t)
)
#+END_SRC

* View who called a function and stop message (debugging only)
This functions below returns the stack which called a function,
and optionally, you can kill all messages related.
Uncomment only when using, since it messes with Helm.
Source: https://superuser.com/questions/669701/emacs-disable-some-minibuffer-messages


#+BEGIN_SRC emacs-lisp   
;(defun suppress-messages (old-fun &rest args)
;  (cl-flet ((silence (&rest args1) (ignore)))
;    (advice-add 'message :around #'silence)
;    (unwind-protect
;         (apply old-fun args)
;      (advice-remove 'message #'silence))))
;
;
;(advice-add 'org-latex-preview :around #'suppress-messages)
;
;(defun who-called-me? (old-fun format &rest args)
;  (let ((trace nil) (n 1) (frame nil))
;      (while (setf frame (backtrace-frame n))
;        (setf n     (1+ n) 
;              trace (cons (cadr frame) trace)) )
;      (apply old-fun (concat "<<%S>>\n" format) (cons trace args))))
;
;(advice-add 'message :around #'who-called-me?)
;
#+END_SRC
* Snippets 
  

#+BEGIN_SRC emacs-lisp   
(use-package yasnippet
  :defer t
  :config
  (yas-global-mode 1)
  (yas-reload-all)
 )
#+END_SRC

Tirei pois passe a usar o evil-leader
  functions below come from:
  https://github.com/Kungsgeten/yankpad/issues/24
 (defun yankpad-maybe-expand ()
   "First tries to expand word at point. If it fails it looks up
 the major mode keypress for tab, and then the global key map."
   (interactive)
   (when (equal nil (yankpad-expand))
     (if (lookup-key (current-local-map) (kbd "TAB"))
         (call-interactively (lookup-key (current-local-map) (kbd "TAB")))
       (call-interactively (lookup-key (current-global-map) (kbd "TAB"))))))
 
 (defvar yankpad-expand-mode-map
   (let ((map (make-sparse-keymap)))
     (define-key map (kbd "TAB") 'yankpad-maybe-expand)
     (define-key map (kbd "<tab>") 'yankpad-maybe-expand)
     (define-key map (kbd "\C-i") 'yankpad-maybe-expand)
     map))
 
 (define-minor-mode yankpad-expand-mode
   "A mode that first tries to `yankpad-expand' and then if it fails
 look up the major mode keypress for tab, and then if that doesn't
 exist look up the global keypress for tab."
   :lighter nil
   :keymap yankpad-expand-mode-map)
 
 (defun yankpad-expand-mode-on ()
   "Turns on `yankpad-expand-mode'."
   (interactive)
   (yankpad-expand-mode 1))
 
 (define-global-minor-mode global-yankpad-expand-mode yankpad-expand-mode yankpad-expand-mode-on)
  
#+BEGIN_SRC emacs-lisp   
;;teste
(use-package yankpad 
  :straight (yankpad :type git :host github :repo "Kungsgeten/yankpad"
              :fork (:host github :repo "nettoyoussef/yankpad"))
  :defer 5 
  :init
  (setq yankpad-file "~/.emacs.d/snippets/yankpad.org")
  :demand t
  ;; really necessary to have demand t above, so you dont need to execute a function for the package to load first
  ;; see more details at
  ;; https://github.com/Kungsgeten/yankpad/issues/20
  :config
  (bind-key "<f7>" 'yankpad-map)
  ;;(bind-key "<C-\t>" 'yankpad-expand)
  ;;(global-set-key (kbd "<C-tab>") 'yankpad-expand)
  ;;(global-set-key (kbd "<C-z>") 'yankpad-expand)
  ;;(global-yankpad-expand-mode 1)
)
  
;;(use-package smart-tab
;;;;  :init
;;  :config
;;  (setq smart-tab-using-hippie-expand t)
;;  (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand)
;;  (global-smart-tab-mode 1)
;;  )

 #+END_SRC
* Writing
** better overall writing evaluation 

These scripts were based on a routine advanced by Matt Might,
from University of Alabama at Birmingham.
http://matt.might.net/articles/shell-scripts-for-passive-voice-weasel-words-duplicates/
The Emacs' package was created by Benjamin Beckwith.

The routines include:
- Finding duplicate words
- Finding weasel words (words that don't convey meaning or that makes 
  the sentence looks less precise). Those include:
  - adverbs
  - quantitative yet abstract characterization (many, much, several, exceedingly)
  - ``beholder'' words (surprisingly, interestingly, remarkably, clearly) 
  - others
- Passive voice (to avoid excessive use)

#+BEGIN_SRC emacs-lisp   
(use-package writegood-mode 
  :defer t
;;  :init
 )
#+END_SRC
* Spelling correction (Flyspell) 
** langtool (based on languagetool)
#+BEGIN_SRC emacs-lisp   
;; requires languagetool
;; sudo pacman -S languagetool
      
(use-package langtool
  :init
  (setq langtool-java-classpath
        "/usr/share/languagetool:/usr/share/java/languagetool/*")

  ;; do autocorrect automatically after entering a text file
  (dolist (hook '(text-mode-hook))
      (add-hook hook (lambda () (flyspell-mode 1))))
  :defer t
  :config
  (setq langtool-default-language "en-US")
  (add-hook 'markdown-mode-hook
            (lambda () 
               (add-hook 'after-save-hook 'langtool-check nil 'make-it-local)))
 )
#+END_SRC

* Thesaurus
** Star dictionaries - SDCV - Webster thesaurus of 1913 and others
This adds the sdcv package available from https://github.com/gucong/emacs-sdcv to use with the Webster dictionary (star file)
#+BEGIN_SRC emacs-lisp   
;; requires sdcv installed to read star file
;; yay -S sdcv
;; Tell emacs where is your personal elisp lib dir
;;(add-to-list 'load-path "~/.emacs.d/lisp/")
(load "~/.emacs.d/lisp/sdcv-mode")
#+END_SRC

* Set which-key to memorize keybindings

The guide package opens a minibuffer listing the 
commands that finish the current sequence of keybinds.
This is useful if you want to type a command but can't remember how it ends.

#+BEGIN_SRC emacs-lisp   
(use-package which-key 
  :config
  (which-key-mode)
)
#+END_SRC

* Google translate
 #+BEGIN_SRC emacs-lisp   
;; was not able to make it work if a default use package declaration
;; an error would appear:
;; search-failed ",tkk:'"
;; the code from the page below seems to solve the issue
;; https://github.com/atykhonov/google-translate/issues/137
(use-package google-translate
  :init
       (require 'google-translate)

  :functions (my-google-translate-at-point google-translate--search-tkk)
  :custom
  (google-translate-backend-method 'curl)
  :config
  (setq google-translate-default-source-language "en")
  (setq google-translate-default-target-language "pt")
  (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130))
)

;; there is a script for finding the current tkk number
;; on the link below
;; https://github.com/atykhonov/google-translate/issues/52
;;#!/bin/sh
;;
;;tkk_string=`curl --silent -A "Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:59.0) Gecko/20100101 Firefox/59.0" -L http://translate.google.com/ | sed 's/, */\n /g' | grep "tkk" | head -1`
;;
;;first_number=`echo ${tkk_string} | cut -d"'" -f2 | cut -d"." -f1`
;;second_number=`echo ${tkk_string} | cut -d"'" -f2 | cut -d"." -f2`
;;
;;echo '(defun google-translate--search-tkk () "Search TKK." (list '"${first_number}"' '"${second_number}"'))'


#+END_SRC

* Vterm (external terminal)

 #+BEGIN_SRC emacs-lisp   
(use-package vterm
    :straight t)
#+END_SRC

* Tangle file on saving
This must be at the end of the document.
Source: [[https://raw.githubusercontent.com/joseph8th/literatemacs/master/README.org][github]].


#+BEGIN_SRC emacs-lisp
(defvar ey--tangle-on-saving)
(make-variable-buffer-local 'ey--tangle-on-saving) ;; this makes the variable buffer-local 

(defun ey--toggle-tangle-on-saving()
   "Change the current buffer to a tangle on saving buffer"
    (if ey--tangle-on-saving (setq 'ey--tangle-on-saving nil) (setq 'ey--tangle-on-saving t))
)

(defun ey--tangle-on-saving ()
  "Export block codes on saving"
  (if ey--tangle-on-saving
        (org-babel-tangle)
  )
)

(add-hook 'after-save-hook (lambda ()(ey--tangle-on-saving)))
#+END_SRC 

# Local Variables:
# eval: (setq ey--tangle-on-saving t)
# End:


