emacs/init.el
(use-package dumb-jump 
  :hook
  (('xref-backend-functions . #'dumb-jump-xref-activate))
  :defer t
  :config 
  ;;(setq dumb-jump-prefer-searcher 'rg)
  ;;(dumb-jump-mode)
)

;; Enable and install magit
(use-package magit
  :defer t
)

(use-package ivy
  :defer t
)

(use-package ranger 
  :defer t
  :config

  ;; panel configuration
  (setq ranger-parent-depth 1)
  (setq ranger-width-preview 0.5)
  (setq ranger-width-parents 0.12)
  (setq ranger-max-parent-width 0.12)

  ;; show hidden files
  (setq ranger-show-hidden t)

  ;; set ranger for previewing files
  (setq ranger-preview-file t)

  ;; maximum size of files for preview - in mb
  (setq ranger-max-preview-size 10)

  ;; dont show binary files
  (setq ranger-dont-show-binary t)
)

;(defun suppress-messages (old-fun &rest args)
;  (cl-flet ((silence (&rest args1) (ignore)))
;    (advice-add 'message :around #'silence)
;    (unwind-protect
;         (apply old-fun args)
;      (advice-remove 'message #'silence))))
;
;
;(advice-add 'org-latex-preview :around #'suppress-messages)
;
;(defun who-called-me? (old-fun format &rest args)
;  (let ((trace nil) (n 1) (frame nil))
;      (while (setf frame (backtrace-frame n))
;        (setf n     (1+ n) 
;              trace (cons (cadr frame) trace)) )
;      (apply old-fun (concat "<<%S>>\n" format) (cons trace args))))
;
;(advice-add 'message :around #'who-called-me?)
;

(use-package yasnippet
  :defer t
  :config
  (yas-global-mode 1)
  (yas-reload-all)
 )

;;teste
(use-package yankpad 
  :straight (yankpad :type git :host github :repo "Kungsgeten/yankpad"
              :fork (:host github :repo "nettoyoussef/yankpad"))
  :defer 5 
  :init
  (setq yankpad-file "~/.emacs.d/snippets/yankpad.org")
  :demand t
  ;; really necessary to have demand t above, so you dont need to execute a function for the package to load first
  ;; see more details at
  ;; https://github.com/Kungsgeten/yankpad/issues/20
  :config
  (bind-key "<f7>" 'yankpad-map)
  ;;(bind-key "<C-\t>" 'yankpad-expand)
  ;;(global-set-key (kbd "<C-tab>") 'yankpad-expand)
  ;;(global-set-key (kbd "<C-z>") 'yankpad-expand)
  ;;(global-yankpad-expand-mode 1)
)
  
;;(use-package smart-tab
;;;;  :init
;;  :config
;;  (setq smart-tab-using-hippie-expand t)
;;  (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand)
;;  (global-smart-tab-mode 1)
;;  )

(use-package writegood-mode 
  :defer t
;;  :init
 )

;; requires languagetool
;; sudo pacman -S languagetool
      
(use-package langtool
  :init
  (setq langtool-java-classpath
        "/usr/share/languagetool:/usr/share/java/languagetool/*")

  ;; do autocorrect automatically after entering a text file
  (dolist (hook '(text-mode-hook))
      (add-hook hook (lambda () (flyspell-mode 1))))
  :defer t
  :config
  (setq langtool-default-language "en-US")
  (add-hook 'markdown-mode-hook
            (lambda () 
               (add-hook 'after-save-hook 'langtool-check nil 'make-it-local)))
 )

;; requires sdcv installed to read star file
;; yay -S sdcv
;; Tell emacs where is your personal elisp lib dir
;;(add-to-list 'load-path "~/.emacs.d/lisp/")
(load "~/.emacs.d/lisp/sdcv-mode")

(use-package which-key 
  :config
  (which-key-mode)
)

;; was not able to make it work if a default use package declaration
;; an error would appear:
;; search-failed ",tkk:'"
;; the code from the page below seems to solve the issue
;; https://github.com/atykhonov/google-translate/issues/137
(use-package google-translate
  :init
       (require 'google-translate)

  :functions (my-google-translate-at-point google-translate--search-tkk)
  :custom
  (google-translate-backend-method 'curl)
  :config
  (setq google-translate-default-source-language "en")
  (setq google-translate-default-target-language "pt")
  (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130))
)

;; there is a script for finding the current tkk number
;; on the link below
;; https://github.com/atykhonov/google-translate/issues/52
;;#!/bin/sh
;;
;;tkk_string=`curl --silent -A "Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:59.0) Gecko/20100101 Firefox/59.0" -L http://translate.google.com/ | sed 's/, */\n /g' | grep "tkk" | head -1`
;;
;;first_number=`echo ${tkk_string} | cut -d"'" -f2 | cut -d"." -f1`
;;second_number=`echo ${tkk_string} | cut -d"'" -f2 | cut -d"." -f2`
;;
;;echo '(defun google-translate--search-tkk () "Search TKK." (list '"${first_number}"' '"${second_number}"'))'

(use-package vterm
    :straight t)

(defvar ey--tangle-on-saving)
(make-variable-buffer-local 'ey--tangle-on-saving) ;; this makes the variable buffer-local 

(defun ey--toggle-tangle-on-saving()
   "Change the current buffer to a tangle on saving buffer"
    (if ey--tangle-on-saving (setq 'ey--tangle-on-saving nil) (setq 'ey--tangle-on-saving t))
)

(defun ey--tangle-on-saving ()
  "Export block codes on saving"
  (if ey--tangle-on-saving
        (org-babel-tangle)
  )
)

(add-hook 'after-save-hook (lambda ()(ey--tangle-on-saving)))
